[
  {
    "Version": "1.1.6.8",
    "Content": "Fixed cargo/location auto-update thanks to @DrDoomDmc"
  },
  {
    "Version": "1.1.6.7",
    "Content": "more great contributions from @DrDoomDmc:\r\n* Fix log format change\r\n* Show current settlement"
  },
  {
    "Version": "1.1.6.6",
    "Content": "* engineer unlock recipes added thanks to @PiezPiedPy\r\n\r\n* more blueprints and fix of duplicate ingredients by @DrDoomDmc"
  },
  {
    "Version": "1.1.6.5",
    "Content": "* various fixes to blueprints and ingredients, thanks to @DrDoomDmc"
  },
  {
    "Version": "1.1.6.2",
    "Content": "* prevent app from crashing when logs contain unknown equipment (you'll get a popup for now instead)\r\n\r\n* top source system now list the settlement name as well, thanks to @DrDoomDmc"
  },
  {
    "Version": "1.1.6.1",
    "Content": "Great contributions from @DrDoomDmc:\r\n* handling of new journal events to update odyssey ingredients in cargo\r\n* performance improvement with filtering blueprints\r\n* ingredient names fix\r\n* the app remembers if it was maximized\r\n* @Synthesis and @Technology filters fixed"
  },
  {
    "Version": "1.1.6.1",
    "Content": "Great contributions from @DrDoomDmc:\r\n* handling of new journal events to update odyssey ingredients in cargo\r\n* performance improvement with filtering blueprints\r\n* ingredient names fix\r\n* the app remembers if it was maximized\r\n* @Synthesis and @Technology filters fixed",
    "Reset": true
  },
  {
    "Version": "1.1.6.0",
    "Content": "* Odyssey materials and blueprints are now integrated in EDEngineer\r\nthanks a lot for the amazing contributions from @DrDoomDmc and @Gimi1967\r\n\r\nstock in the cargo might not update properly yet - it hopefully should come soon\r\n\r\n* french localization update ; thanks a lot to @drmagoo33450 and @DrDoomDmc "
  },
  {
    "Version": "1.1.5.10",
    "Content": "* Chinese localization available, thanks a lot to @YASAN666 and @skyter \r\n* Fixed Engineered FSD V1 materials, thanks to @RadarCZ \r\n\r\n* Fixed ruthenium maximum capacity\r\n* Heatsink refill now always 100%"
  },
  {
    "Version": "1.1.5.9",
    "Content": "* Added new technology Engineered FSD V1, thanks to @eisbaer9"
  },
  {
    "Version": "1.1.5.7",
    "Content": "* Expanded state for when ingredients are grouped is now persistent\r\n\r\n* Add FSD experimental effects for Chloe Sedesi, thanks to @CMDR-Cometborne"
  },
  {
    "Version": "1.1.5.6",
    "Content": "* Update for the engineers in Colonia following the successful conclusion of operation La Forge with new blueprints ; thanks for the great work @CMDR-Cometborne"
  },
  {
    "Version": "1.1.5.5",
    "Content": "* Fixed coriolis interaction for a number of blueprints, thanks to @PwccaCode !\r\n\r\n* Portuguese localization update, thanks to @PwccaCode !\r\n* German localization update, thanks to @Tacitor !\r\n* Russian localization update, thanks to @ivanshum !\r\n\r\nHappy holidays to all commanders and their close ones. Please stay safe, we're all in this together and we'll get through these challenging times soon enough!"
  },
  {
    "Version": "1.1.5.3",
    "Content": "Fixed a potential crash during the loading of shopping list from file and made the process faster"
  },
  {
    "Version": "1.1.5.0",
    "Content": "#1.1.5.0\r\n\r\n* Added ability to save/load shopping lists from file. You can access the feature in the \"Import/Export Settings\" window or, if you have a shopping list active, using the button Load/Save at the top of shopping list.\r\nThanks a lot for @lythix for coming up with the feature and implementing it!\r\n\r\n#1.1.4.11\r\n\r\n* Fixed a couple of minor GUI issues (tooltip not showing in a few places)\r\n* Added a \"Drag Me\" indicator on the shopping list splitter (lots of people miss the fact that the list can be resized to make it scrollable)\r\n\r\n* Czech language update thanks to @JohnXaverius\r\n\r\n#1.1.4.10\r\n\r\n* Spanish translation updated and completed, thanks to @LuisMorenoSerrano\r\n\r\n#1.1.4.9\r\n\r\n* Added an option when launching the local API to let other computers access it via the computer's running the server IP address.\r\n\r\n#1.1.4.8\r\n\r\n* Add the missing unlock data for the Colonia and Witch Head engineers thanks to @CMDR-Cometborne \r\n* Fix for ammo capacity blueprints  thanks to @CMDR-Cometborne too !\r\nThe blueprints for the ammo capacity increase of point defence,\r\nheat sink launcher, and chaff launcher have been made more rational\r\nin-game.  Instead of having 3 grades with only grade 3 giving an\r\nextra usable shot, there is now only a grade 1 blueprint that results\r\nin a capacity increase.  This blueprint has the cost of the old g3\r\nblueprint.\r\n\r\n#1.1.4.7\r\n\r\n* Czech localization update, thanks to @JohnXaverius\r\n* New engineer Chloe Sedesi added, thanks to @CMDRTheDarkLord\r\n\r\n#1.1.4.6\r\n\r\n* Fixed an issue that could trigger a crash of the app when hovering the shopping list blueprints/ingredients\r\n* Added a print button to the shopping list which will render it to an image file\r\n\r\n#1.1.4.5\r\n\r\n* Fixed a bug that could occur when loading the initial journal entry (caused by latest patch)\r\n\r\n#1.1.4.4\r\n\r\n* Portuguese localization update thanks to @MegaMMC\r\n* Spanish localization update thanks to @Tihersarc\r\n* Russian and French localization update thanks to @VChet\r\n* @CMDR-Cometborne updated the blueprints offered by the Colonia engineers, including the new blueprints exclusive to Colonia (SCB G4, life support G5) !\r\n\r\n#1.1.4.3\r\n\r\n* Fixed an issue with speech synthesis that could make the application fail to start\r\n\r\n* Polish localization update thanks to @Nicked111 \r\n* Portuguese localization update thanks to @MegaMMC\r\n\r\n#1.1.4.2\r\n\r\n* Added an Export/Import settings window to the menu allowing you to save your settings to file and load them somewhere else\r\n* Fixed a bug that made the application crash when reducing the font size on the right panel to the minimum\r\n\r\n#1.1.4.1\r\n\r\nLots of contributions for this update, thanks a ton to the kind souls who submit pull requests to keep the application up to date!\r\n\r\nHave a lovely end of the year holidays everyone!\r\n\r\n=====\r\n\r\n* @CMDR-Cometborne :\r\nadded group Guardian/Thargoid to all unknowns\r\nadded hints where/how to get Thargoid stuff\r\nCorrect rarity value of Ship Flight Data\r\nAll existing DSS blueprints have been replace with a single new blueprint named expanded probe scanning radius\r\n\r\n* @CmdrWode :\r\nSplit both Guardian and Thargoid items into two subgroups (4 groups total)\r\nFix to deal with Cargo events that contain no Inventory field\r\n\r\n* @JohnXaverius :\r\nczech localization update\r\n\r\n* @enachos71 :\r\nGuardian Gauss Cannon Munitions was missing Guardian Technology Components, 6 needed in the blueprint\r\n\r\n* @TheBlackbird123 :\r\nspanish localization update\r\n"
  },
  {
    "Version": "1.1.4.0",
    "Content": "#1.1.4.0\r\n\r\n* Added a new menu entry to fully reload your logs in the application if you ever encounter oddities in your material list\r\n\r\n* Fix materials for large shard premium reload blueprint, thanks to @CMDR-Cometborne\r\n* All guardian blueprint segments are classified as very rare, thanks to @CMDR-Cometborne\r\n* Fixed Meta Alloy Hull Reinforcements unlock Requirements, thanks to @MaximumWoahverdrive\r\n* Attempt at fixing Toast, thanks to @MaximumWoahverdrive\r\n\r\n#1.1.3.12\r\n\r\n* German localization update provided by @MaximumWoahverdrive, thanks for the contribution\r\n\r\n#1.1.3.11\r\n\r\n* Entire russian localization completed by @VChet! Thanks a lot for the great contributions\r\n\r\n#1.1.3.10\r\n\r\n* Massive Colonia Engineers update provided by @CMDR-Cometborne, thanks a lot to him! Details:\r\n* Petra Olmanova, Marsha Hicks, Etienne Dorn and Mel Brandon added\r\n* Added their locations\r\n* Added new blueprint (Chaff Launcher Ammo Capacity)\r\n* Added commodities related to the new engineers (Progenitor Cells, Osmium, Occupied Escape Pod)\r\n\r\n* Minor Czech localization update, thanks to @JohnXaverius\r\n\r\n#1.1.3.8\r\n\r\nNew technology broker unlocks for 3.2 / Beyond Chapter 3:\r\n\r\n* Guardian Gauss Cannon (Fixed)\r\n* Guardian Plasma Charger (Fixed, Turreted)\r\n* Guardian Shard Cannon (Fixed, Turreted)\r\n* Javelin, Lance, Trident (Fighters)\r\n* Shock Cannon (Fixed, Gimballed, Turreted)\r\n\r\nThanks a lot to @CMDR-Cometborne for providing all the data!\r\n\r\n#1.1.3.6\r\n\r\n* Added a Clear button to the shopping list : clicking it will entirely delete your shopping list (currently no way to undo so be careful)\r\n\r\n* Fixed blueprint Plasma Accelerator - Dazzle Shell : added missing 5 Mechanical Components to the recipe : thanks to @Derriick for fixing it\r\n\r\n#1.1.3.4\r\n\r\n* Added a chart for cargo history : run the local API and click on the Cargo History entry in the menu. Go to /chartData instead if you want a raw json to exploit the data yourself. It can be slow to generate according to how many logs you have! Keep in mind this is a bit experimental so usability might not be much refined.\r\n\r\n#1.1.3.3\r\n\r\n* Added expander to show/hide commanders available to EDEngineer\r\n* Better last update text in bottom row\r\n* Fixed vertical alignment of bottom row when the window wasn't wide enough (text would disappear)\r\n\r\n* Can now import experimentals from Coriolis, thanks to @willyb321 !\r\n* German localization update, thanks to @MBGTBenjamin !\r\n"
  },
  {
    "Version": "1.1.3.0",
    "Content": "#1.1.3.0\r\n* Added API ON/OFF indicator at the bottom of the window\r\n* Removed pesky error message when you stopped the API\r\n\r\n* Massive Blueprint Update thanks to @CMDR-Cometborne :\r\n\t* New Blueprints:\r\n\t\t* Guardian Hull Reinforcement\r\n\t\t* Guardian Plasma Charger (Turreted, Large)\r\n\t\t* Guardian Shard Cannon (Fixed, Medium)\r\n\t\t* Guardian Shard Cannon (Turreted, Medium)\r\n\t\t* Guardian Shield Reinforcement\r\n\t\t* Shock Cannon (Fixed, Medium)\r\n\t\t* Shock Cannon (Gimballed, Medium)\r\n\t\t* Shock Cannon (Turreted, Medium)\r\n\t* Updated requirements of existing blueprints\r\n\r\n* Russian localization update, thanks to @VChet!\r\n\r\n#1.1.2.8\r\n* Added advanced sorting to the blueprint list : you can cumulate column sorting (e.g. sort by name, then by grade etc...) ; the rank are represented by arrows (first column ordering is one arrow, then two arrows, and so on). Revert back to sorting with one column by sorting two times the same column\r\n\r\n* Fixed headers in the API response to comply with CORS\r\n\r\n#1.1.2.6\r\n* Added Engineers system in the blueprint list (mouse over an engineer to get his system, planet and base)\r\n* Added a PATCH method to update the ShoppingList from the local API using Coriolis Guids\r\n\r\n* Added Life Support Reinforced G5\r\n\r\n* Czech localization update, thanks to @JohnXaverius for the contribution!\r\n* Portuguese localization update, thanks to @KingRider for the contribution!\r\n* German localization update, thanks to @nepomuk16321 for the contribution!\r\n\r\n#1.1.2.5\r\n* Material Trader suggestions won't include non-tradable ingredients (like thargoid ingredients or others)\r\n\r\n#1.1.2.4\r\n* Fixed an issue with multi-commanders disappearing. If you still don't see your multiple commanders, please delete the aggregation.json file located in your AppData/Roaming/EDEngineer directory.\r\n* Fixed Thargoid Carapace rarity (Common instead of Very Rare) which impacts the maximum number you can carry.\r\n\r\n#1.1.2.3\r\n* Made the Material Trader indicators more readable\r\n* Handle an issue that could occur on startup after EDEngineer did not properly exit\r\n* Synthesis and Technology filters moved from Engineer filters to Types filters\r\n\r\n* New AX/Guardian Synthesis kindly added by @Tigir\r\n\r\n#1.1.2.2\r\n* Made the material trader panel a bit cleaner\r\n* Added rarities (so you know what you're trading)\r\n* Added material trader location hints\r\n* In the shopping list, show missing items first\r\n* Instead of Material, show Raw or Manufactured in any blueprint detail (as well as the shopping list)\r\n\r\n* Fixed an issue in the ship loadout that made hardpoints appear in the Livery category\r\n* Fixed an issue in the calculation of material trading for out-of-group materials\r\n"
  },
  {
    "Version": "1.1.2.0",
    "Content": "#1.1.2.0\r\n\r\n* Added material trader suggestions in the shopping list:\r\nShows material trading suggestion (taking into account your cargo and the entire shopping list).\r\nSuggestions are sorted by how big the trade is compared to your cargo, minus an eventual amount already needed in the shopping list.\r\nOrange entries indicates a trade suggestion that will not completely fulfill your requirement (but might help).\r\n\r\n* Brazilian localization update, thanks to @KingRider\r\n* Russian localization update, thank to @VChet\r\n\r\n#1.1.1.28\r\n\r\n* EDEngineer will save an aggregation of your logs upon quitting the application such that next time you launch the app it will load faster.\r\nIt's useful if you have lots of logs or want to clean your logs without losing system's history).\r\nThat file should be located in AppData if you want to delete it (for instance if you delete your logs to remove a Commander, you'll also need to delete the aggregation file).\r\n\r\n* Russian localization update, thanks to @VChet\r\n\r\n#1.1.1.21\r\n\r\n* will now properly track technology broker events\r\n* missions rewarding commodities weren't taken into account\r\n* various hotfixes published since latest release notes\r\n\r\n#1.1.1.11\r\n\r\n* Added back commodity tracking (used for engineers unlocked and technologies). They were missing for a while so it's possible the tracking is a bit rusty so if you notice a desyn between your cargo and what's displayed in EDEngineer,\r\n open an issue on GitHub with your latest logs attached so I can have a look.\r\n* Fixed rarity icons that were missing\r\n\r\n* Guardian PD and Guardian Shard Cannons (turreted and fixed) blueprints, thanks to @CMDR-Cometborne for the update\r\n\r\n#1.1.1.7\r\n\r\n* Added error handling to the splash screen in case there's a loading failure\r\n* More tweaks to the compressed json (let me know if your anti-virus doesn't like the fact that EDEngineer uses an embedded zip file)\r\n\r\n* Czech localization update thanks to @JohnXaverius\r\n\r\n#1.1.1.1\r\n\r\n* Added a loading screen at startup\r\n* Compress resource files to reduce the size of the app\r\n\r\n* Removed duplicated ingredients in dazzle ship recipe, thanks to @corenting\r\n* Added Guardian FSD Booster blueprint, thanks to @CMDR-Cometborne\r\n\r\n* FULL czech localization provided by @JohnXaverius!"
  },
  {
    "Version": "1.1.1.0",
    "Content": "#1.1.1.0\r\n* Fixed an issue with the shopping list sync that could make it reduce another blueprint having the same ingredients as the one you crafted in game\r\n* Added a text for technologies to warn the user about commodities being required to craft them (not tracked anymore by EDEngineer but that might come back one day)\r\n* Some text align changes to make things a bit prettier\r\n* German localization update, thanks to @Pumpken\r\n\r\n# 1.1.0.9\r\n* Blueprints' count in shopping list can now be edited directly by hand\r\n* Blueprints effects in the ship loadout should now show nicely (justfied alignment)\r\n\r\n# 1.1.0.8\r\n* Effects of experimental blueprints added\r\n\r\n# 1.1.0.7\r\n* Loadout tab added\r\n* Blueprints effects added\r\n* Better algorithm for reorganizing shopping list tiles (there shouldn't be any more holes)\r\n* Expand/Collapse shopping list tile now disabled if it can't be collapsed (i.e. if there are 4 or more grades with positive counters)\r\n* Fixed an issue for when the log directory couldn't be retrieved\r\n\r\n# 1.1.0.2\r\n* Added buttons in the shopping list to expand/collapse multi-grade blueprints (double click the orange circles to see it in action)\r\n* Fixed an issue when parsing TechnologyBroker event\r\n"
  },
  {
    "Version": "1.1.0.0",
    "Content": "#1.1.0.0\r\n* Shopping list redesign\r\n* Attempt at better synchronization between your shopping list and what you craft in game\r\n\r\n* Added missing blueprints (Grade 4 and 5 of Power plant's low emission and Distributor System/Weapon/Engine focused), thanks a lot to @svetislavn for the update!\r\n\r\n#1.0.9.9\r\n* Added Top System Locations for each ingredient (currently based on your personal logs), check out the tooltip when hovering any ingredient!\r\n\r\n* French localization update thanks to @Catsbuggy\r\n\r\n\r\n> Toast Notifications don't work anymore (for when a favorite blueprint is ready). The feature broke with Windows Fall Creators Update and I haven't found a way to fix it yet, sorry!\r\n\r\n#1.0.9.7\r\n Fixed an issue with the shopping list synchronization\r\n* Added missing experimental effects\r\n* Small animations in the cargo list\r\n* Now handle the 3.0 Mission Completed events (wasn't aware it got changed)\r\n* Guardian Module Blueprint Segment is now a Data instead of a Material\r\n\r\n* Big russian localization update provided by @VChet\r\n\r\n#1.0.9.4\r\n* Various hotfixes following the previous update\r\n* Updated FSD injection synthesis ingredients\r\n* Fixed material traded event which wrongly updating the cargo\r\n* Added guardians ingredients and a new origin (Ancient/Guardian Ruins)\r\n* Added missing materials and fixed the categories\r\n* Added experimental effects\r\n* Added technologies (from technology broker)\r\n* Added a category filter (Module/Synthesis/Experimental Effects/Technologies/Engineer Unlock)\r\n* Synchronize your shopping list with what you craft:\r\n  > If EDEngineer is running when you craft a blueprint then it will try to find which blueprint in the shopping list needs to be removed\r\n  > If it can find it, it will decrease the amount in your shopping list\r\n  > If it can't, it won't do anything\r\n  > Won't work for Engineer Unlocks\r\n  > I'm not 100% confident it's bug free, you can enable/disable it with the checkbox in your Shopping List header\r\n\r\n#1.0.9.1\r\n* Removed Thresholds and Total cargo carrying capacity as well as their associated notifications\r\n* Added Ruthenium ingredient and updated rarities on some ingredients\r\n* Ingredients can now be grouped in their category (you can disable this with a toggle button on top of the list)\r\n* Added a carrying capacity for each ingredient based on their rarity (progress bar and information in tooltip)\r\n* Added an option to sort by Rarity (on top of Name and Count)\r\n* Handle Material Trade event\r\n* Handle Technology Broker event\r\n\r\n* Update to spanish localization thanks to @jcmangado"
  },
  {
    "Version": "1.0.9.0",
    "Content": "#1.0.9.0\r\nFixed an issue that with Wreckage Components that mixed up the commodity and the material dropped by Thargoids.\r\n\r\nRussian localization update, thanks to @VChet\r\nBrazilian localization update, thanks to @rafaelpivatto\r\n\r\n#1.0.8.9\r\nEDEngineer will now handle unkown log entries instead of showing the old popup. The unknown entries will appear in your material/data list.\r\n\r\nLocalization update, thanks a lot to these guys :\r\n* German: @KaiKiehl\r\n* Brazilian: @wesleymoura\r\n* French: @romainja\r\n\r\n#1.0.8.8\r\n* Raw/Manufactured filters for materials\r\n* Cargo export in the API now includes your configured thresholds\r\n\r\n* Fixed for good the green checkmark and red cross icons in the shopping list\r\n\r\n* German localization update, thanks to @nepomuk16321\r\n* Russian localization update, thanks to @VChet!\r\n* French localization update, thanks to @fbrossar25!\r\n\r\n\r\n#1.0.8.7\r\n* Added sorting by thresholds for your cargo (will show items in order of how their count is above of the configured thresholds for easier cleanup)\r\n* Stop hiding the window when opening a configuration popup dialog\r\n* Fixed a display issue with the shopping list when switching active commander\r\n* Added Signal Source to the list of origins for Atypical Encryption Archives\r\n\r\n* Portuguese translation update, thanks to @wesleymoura!\r\n* Missing french localization added, thanks to @fbrossar25 for the contribution!\r\n\r\n#1.0.8.6\r\n* You can now edit thresholds in the main window (as long as there is a threshold)\r\n* The \"Help Translate\" button that shows when you pick a language now links to a dedicated page on the project's Wiki\r\n* Added CORS headers support for the API\r\n* Updated all external dependencies\r\n* Fixed an alignment issue with the red cross and green check when many items are added to the shopping list\r\n\r\n* NEW Synthesis added from the 2.4 update. Thanks a lot to @CMDR-Cometborne for providing everything needed!\r\n\r\n* NEW available language: brazilian portuguese. Thanks a ton to @rpivatto, @wesleymoura and CMDRs Moraes, Wladimir JRC and Warlord from brazilian minor faction Cobra Wing!\r\n* Russian localization update with lots of fixes and missing translations added. Many thanks to @VChet!\r\n* German localization update which adds most of the missing text to the application. Thanks a lot to @nepomuk16321!\r\n\r\n\r\n#1.0.8.5\r\n* Hotfix an issue related to materials renaming\r\n\r\n#1.0.8.4\r\n* New materials and datas are available, as well as updated names for 2.4! Thanks to @HighwaymanEd and @JohnXaverius on GitHub for providing the new data, as well as GoldenPablo on discord for providing his logs and screenshots.\r\nYour thresholds had to be cleared for this update, sorry!\r\n\r\n* Fixed an issue with the warning message when EDEngineer doesn't recognize a material such that it will now show correctly the unknown code from the game logs.\r\n\r\n* Translations might need to be updated, and apparently new synthesis are available (see issue #255 on GitHub if you would like to help)\r\n\r\n#1.0.8.3\r\n* Fixed the publisher name of the application\r\n\r\n#1.0.8.2\r\n* Fixed an issue with the local API that would make Commanders with a space in their name have their data unavailable\r\n\r\n* German translation update, thanks a lot to @nepomuk16321 and sorry for the late deployment!\r\n\r\n#1.0.8.1\r\n* Fixed an issue when handling the newest EngineerContribution logs"
  },
  {
    "Version": "1.0.8.0",
    "Content": "#1.0.8.0\r\n* Added newest Thargoids discoveries to the app, thanks a lot to @JohnXaverius and Jezzer for the exhaustive screenshots and information!\r\n* Handle new journal operation for engineer contributions, I haven't really tested that one so let me know how if it goes wrong the next time you contribute to an engineer.\r\n\r\n#1.0.7.9\r\n* Fixed the ingredient for G3 Sensor Wide Angle, thanks to @spoonwzd for reporting the issue and thanks to @GrimbaldTheGrim for fixing it!\r\n* German localization update (missing translation added and various fixes), thanks to @nepomuk16321 for the contribution!\r\n\r\n#1.0.7.8\r\n* Added a button that appears when you have at least one ingredient highlighted (left side panel) so you can quickly see if you have any (clicking on it will unhighlight entries)\r\n\r\n* German localization update courtesy of @nepomuk16321!\r\n\r\n#1.0.7.7\r\n* Cleaned up old release notes, it was becoming a bit too bloated !\r\n\r\n* Merged two different categories of blueprint that were supposed to be the same (Frame Shift Wake Scanner and Wake Scanner ; Wake Scanner is the final name). Thanks to @Velak for spotting the issue and fixing it!\r\n\r\n* German localization completed thanks to @nepomuk16321!\r\n\r\n#1.0.7.5\r\n* New filter in the Ignored/Favourites category to show blueprints included in the shopping list\r\n* Various performance enhancements\r\n\r\n* Fixed an issue for users who use high DPI screens when saving the window position\r\n\r\n* Full russian translation provided by @VChet !\r\n\r\n#1.0.7.4\r\n* Added a graphic configuration window where you can configure font size per panel (left/right/bottom) as well as window Opacity (which is applied only when the Window is locked)\r\n* Added a purple gear to the main window where you can access the context menu which contains all settings\r\n* Made the context menu a bit less austere with icons\r\n\r\n* Fixed an issue with the local API server which would keep running automatically even after being stopped under certain circumstances\r\n\r\n* Full polish translation is now ready thanks to @gienkov !\r\n\r\n#1.0.7.3\r\n* Changed the log folder selection window to a more user-friendly one (used to be a tree view)\r\n* Reduced font size of ingredients in the left panel\r\n\r\n* @cocafr fixed a typo in the french localization related to Tempered Alloys\r\n\r\n#1.0.7.2\r\n* In the shopping list, you can now put your mouse over a blueprint to highlight the ingredients that compose it (and reversely).\r\n\r\n* Fixed the engineer list of Sensor and Scanner blueprints, thanks to @Thurion for spotting the issue and fixing it!\r\n\r\n* Polish localization is now available, thanks a lot to @gienkov for providing it all !"
  },
  {
    "Version": "1.0.7.0",
    "Content": "#1.0.7.0\r\n* Notifications overhaul : you can now configure your notifications (blueprint ready, cargo almost full and threshold reached) to use speech synthesis. There should be less spam of notifications if multiple events are triggered at the same time.\r\n* Faster text search when using the search\r\n\r\n* Added the high grade emissions locations to related materials, thanks to @Psieonic for adding this to the reference data !\r\n* Added recipes for engineers unlock, they work the same as any other blueprint (with type \"Unlock\") ; thanks to @vetall812 for adding this to the reference data !\r\n* Fixed the engineer's lists of many of the new sensors blueprints ; thanks to @AndreyATGB for spotting the issue and fixing it !\r\n\r\n* Fixed a black window bug with Silent Launch when the window was unlocked (now the window will be minimized on startup if you use silent launch combined with unlocked window)\r\n\r\n* API Server : Added thresholds to cargo list and a new route shopping-list\r\n\r\n\r\n#1.0.6.7\r\n* Added a search box for blueprints:\r\nSearch visible blueprints (the ones that already satisfy your active filters) with terms separated by a space.\r\nExamples :\r\n>\"elvira shield G3\"\r\n>\"mc 5 efficient\"\r\n>\"plasma\"\r\n\r\n* Fixed a bug with the shopping list that would occur if you emptied it after resizing it (remember to double click the red splitter to make it behave like a magnet)\r\n\r\n\r\n#1.0.6.6\r\n* Fixed an issue that made the application crash upon starting the game after EDEngineer.\r\n* Removed Tiara Fortune from the engineers that can craft Surface Scanner blueprints after grade 3, thanks to @Thurion for spotting the issue and fixing this!\r\nIssues in blueprint can be fixed pretty quickly so if you find any wrong information, you can report it and even fix it for every user :)\r\n\r\n\r\n#1.0.6.5\r\n* Added a scrollbar for the shopping list in case it gets too big.\r\n* Added a Silent Launch option in the context menu of the task tray icon. If you activate it, EDEngineer will start hidden.\r\n* Removed the persistence of highlighted ingredients as it's now a very specific filter. Users didn't notice they had highlighted ingredients and were wondering why blueprints weren't showing up. Each time you start the application, it will now forget which ingredient you highlighted.\r\n\r\n* Prepared localization for new text, if you feel up to the task don't hesitate to contribute to the localization.json file! You just have to fill the null values for your corresponding language.\r\n\r\n\r\n#1.0.6.4\r\n* Various fixes related to the previous updates regarding logs not being taken into account and windows 7 users having errors\r\n\r\n\r\n"
  },
  {
    "Version": "1.0.6.0",
    "Content": "#1.0.6.0\r\n* Added new blueprints that are available in the 2.3 update, thanks a lot to @AndreyATGB for adding them to the application!\r\n* If more than two Favorite blueprints are available at the same time, you'll get only one toast telling you that multiple blueprints are now craftable instead of potentially getting flooded by notifications.\r\n* Removed the Ingredient Filter ; it's now replaced with the highlighted ingredients feature. Highlight an ingredient to show blueprints that use it ; highlight multiple ingredients to see all the blueprints that use at least one of the highlighted ingredients.\r\n* Added a button to remove all highlighted ingredients (the red circle where the Ingredient Filters used to be).\r\n\r\n\r\n#1.0.5.6\r\n* Handle new 2.3 logs (the application should start faster)\r\n\r\n* Fixed escaping issue when exporting data in CSV format via the local API server\r\n* French and Russian localization update (thanks to @VChet and @Pierre-LouisTALBOT)\r\n\r\n\r\n *** NEW BLUEPRINTS *** \r\n If you find new blueprints, contributions are very welcome on GitHub ! The blueprint.json file is pretty easy to understand and you can update it directly in your browser.\r\n I will review the changes you did and if they're good then I will update the application with your contribution.\r\n\r\n\r\n#1.0.5.5\r\n* 2.3 logs beta (unreleased)\r\n\r\n\r\n#1.0.5.4\r\n* Hotfix for very slow startup time\r\n\r\n\r\n#1.0.5.3\r\n* You can now sort your cargo by name or by count via a dropdown that has been added on top of your ingredients list.\r\n\r\n* Fixed an issue that affected the window location which would slightly move each time you started the application if you were using unlocked mode.\r\n\r\n\r\n#1.0.5.2\r\n* Missing blueprint added: Armour Lightweight G4 & G5. Thanks a lot to @NamtarOberon who reported the missing blueprints and made the necessary changes to the application's source!\r\n* Made some fixes in already existing blueprints, you might have lost some favorites/ignored.\r\n\r\n\r\n#1.0.5.1\r\n* Hotfix for manual changes which could make the application crash for new users.\r\n\r\n\r\n"
  },
  {
    "Version": "1.0.5.0",
    "Content": "#1.0.5.0\r\n* Thresholds feature improvements! When you set a threshold, you will see the value in the ingredient list : instead of seeing IRON 5, you will see IRON 5/10 if your threshold is set to 10.\r\n\r\nMoreover, if a threshold is reached then the background of the ingredient will be tinted to let you know it's over what you configured.\r\n\r\nUsers who did not have access to the feature because of their Windows version can now use it (even though they still won't have the toast notifications). Users who can have the toasts notification can disable them too if they find them too annoying (checkout the context menu of the tasktray icon!)\r\n\r\n\r\n\r\n* Handle a rare issue where manual changes couldn't be saved to file.\r\n\r\n\r\n#1.0.4.9\r\n* Minor fix for the handling of logs about Classified Scan Data and Classified Scan Fragment. Please check the amount of these two ingredient, they may have changed so you might want to fix them!\r\n\r\n\r\n#1.0.4.8\r\n* Minor fix for when the shortcut you configured is not recognizable anymore (which can happen if you change your system language for instance). If that happens, you'll be prompted for a new one on startup.\r\n\r\n\r\n#1.0.4.7\r\nNew advanced feature available : Thresholds ! (only available for users on Windows 8 or more recent)\r\nAccess the configuration window from your tasktray icon (right click => Configure Thresholds) and set the thresholds for each item.\r\nYou can set the values individually or apply a value to all selected rows (use Ctrl+A to select every visible row). When your cargo changes and the quantity is equal or above the thresholds, you'll get a warning in the form of a Windows Toast.\r\nIt can quickly become annoying so I would recommend a \"buffer\" approach by setting the limit to 30 (for example) and whenever the limit is reached you would discard the items so that you're at 20 of them (again, it's an example). If you keep it at 30 you'll constantly get annoyed by toast notifications whenever you pick up the item.\r\n\r\n\r\nThis update comes with a bunch of new text that has been kindly translated to german by user @Scorprox ! Many thanks to him.\r\n\r\nOther languages (russian/french/spanish) are still in need of translation so if you think you can help (and if you want to!), jump into the project's GitHub (https://github.com/msarilar/EDEngineer) and search for the file \"localization.json\" (or open the language selection window, there's a button that links to the GitHub's issue). Pull Requests are more than welcome :)\r\n\r\n\r\n#1.0.4.6\r\n* ~40 new blueprints added from 2.2.03! Thanks very much to @elijahgill for the work :)\r\n\r\n\r\n#1.0.4.5\r\n* Added new blueprints from patch 2.3!\r\n* If you have multiple commander, the commander you selected will persist between restarts of EDEngineer\r\n* Added a release notes button in the task tray icon which also shows the current version\r\n* Filters can now be clicked to enable/disable them instead of just clicking on the checkbox\r\n\r\n* Fixed an issue with Polymers commodity which, when bought, would increase the Conductive Polymer count in the cargo\r\n\r\n\r\n#1.0.4.4\r\n* Removed commodities from the application since they're not needed in blueprints anymore; I'll add them back if they ever do actually come back!\r\n* Added a red gear icon for resources needed to unlock engineers\r\n* Added some more tooltips to the interface and unified their look (colors & font)\r\n* Simplified the progress column (the text over the progress bar on each blueprint)\r\n\r\n\r\nThe new patch brought new blueprints but I haven't the exact recipes. Anyone is welcome to come on GitHub and either post their screenshots or directly update the blueprints.json file! https://github.com/msarilar/EDEngineer/issues/93\r\n\r\n\r\n#1.0.4.3\r\n* The shopping list can now be resized at your convenience (won't be saved nor persist if you unlock/lock the window). Double click the red splitter to reset the position and make the shopping list row dynamic again (only visible if you have at least one item in your shopping list).\r\n* Added icon and better title to the window when it shows in your taskbar (only in unlocked mode)\r\n\r\n\r\n\r\nPS: happy new year to everybody!\r\n\r\n\r\n#1.0.4.2\r\n* Spanish translation update (thanks to @TCAS!)\r\n\r\n* Fixes an issue where the application would not track log updates for some users\r\n\r\n\r\n#1.0.4.1\r\n* Added new data from latest story arc development (unknown ship signature and unknown wake data)\r\n\r\n\r\n"
  },
  {
    "Version": "1.0.4.0",
    "Content": "#1.0.4.0\r\n* Shopping List now available : add a blueprint to the shopping list by clicking on the blueprint, and then clicking on the new button (bottom right of the blueprint's details)\r\n* Allow negative numbers to be shown when filtering \"Zero\" stock items\r\n\r\n\r\n#1.0.3.5\r\n* EDEngineer will now ignore logs from the beta if you're in it\r\n\r\n\r\n#1.0.3.4\r\n* You can now highlight ingredients by clicking on them for your own purpose (for example, to flag them for Community Goals or Engineer progress). It doesn't do anything apart from the highlight, and it persists between restarts!\r\n* The tab you selected (Commodities, Materials or Data) will be kept opened when you restart the application\r\n\r\n* French translation update, thanks to @calvin00\r\n\r\n\r\n#1.0.3.3\r\n* Take into account death events (clears up your commodities)\r\n\r\n* Fixed a display issue when selecting a blueprint (the progress bar went from orange to white which made it poorly visible)\r\n* Stop resetting the window position/size when updating !\r\n* Minor performance improvement when running the local API server\r\n\r\n\r\n#1.0.3.2\r\n* Filters are now correctly ordered when localized (an unlock/lock or restart is required to apply the ordering)\r\n* Fixed a localization issue in the Port Prompt for the API\r\n* Localized API results ! Just send the two letter ISO code for the desired language in the new `lang` parameter to get the result translated (example : `http://localhost:XXXX/{path}.{extension}?lang=de` for german results)\r\n\r\n\r\n#1.0.3.1\r\n* Fixed an issue with Emission Data which made EDEngineer not correctly handle related logs\r\n\r\n\r\n"
  },
  {
    "Version": "1.0.3.0",
    "Content": "#1.0.3.0\r\n* Included a local API server (disabled by default) if you want to develop your own third-parties application or if you just want to export your commander's data! Supports Json (default), Xml and Csv. You can launch it via the tasktray icon, I strongly recommend taking a look at the documentation available in the GitHub project's wiki ! https://github.com/msarilar/EDEngineer/wiki \r\n* Added ingredients for blueprint Fragment Canon Double Shot G5\r\n\r\n * FULL russian localization now available! Many thanks to @Morozova, @Buchodt and @VChet for the great work. \r\n* Updated localization. Many thanks to @TCAS and @Scorprox for the great reactivity!\r\n\r\n\r\n#1.0.2.4\r\n* Minor GUI animations to make it a bit more smooth (for example, when you select a blueprint in the right grid)\r\n\r\n* 100% finished french translation! Many thanks to Cmdr Bucho Xin Bu (@Buchodt), @calvin00 and @Giblood for the contributions and dedication!\r\n\r\n\r\n#1.0.2.3\r\n* Added synthesis blueprints (thanks to @ravstar52 for providing the raw data!). They appear with a light blue color and you can distinguish the ingredients you have favorited from blueprints and from synthesis. In the Engineer filter, you have a new filter \"@Synthesis\" and new type filters are available too.\r\n\r\n* Updated localization\r\n\r\n\r\n#1.0.2.2\r\n* Ingredients not used in a single blueprint now appear faded with a hint in the tooltip. Check it out!\r\n\r\n* Fixed an issue with commanders having special characters in their name (<, >, :, \", /, \\, |, ?, *)\r\n* Fixed an issue with users having multiple commanders which made the application not correctly update cargo (visually) after switching from active commander\r\n\r\n* French translation progress (not finished though) ; thanks to @calvin00 and @Giblood for the dedication! Almost there :)\r\n\r\n\r\n#1.0.2.1\r\n* Hotfix to avoid debug popups in the released version\r\n\r\n\r\n"
  },
  {
    "Version": "1.0.2.0",
    "Content": "#1.0.2\r\n* Added material/data count. A warning will popup if you have 5 or less slots available, you can disable that warning in the tasktray icon context menu!\r\n* Added origin details to blueprints ingredients. Icons allow a quick view of the basic origin (market, mission, scan, surface, salvage, mining) and a tool tip will give more detail when you hover the ingredient (like \"Ship salvage (military & authority ships)\"). You can hide icons if it's too much visual noise via the new switch on top of the left panel.\r\n* Added an option to disable \"Blueprint Ready\" notifications in the context menu of the task tray icon (it's enabled by default)\r\n\r\n* Fixed an error in RamTah's blueprint which was missing CMM composite in its ingredient list. Please report any similar issue like this one if you see it!\r\n* Frontier's fixed an issue with \"Material Discovered\" event, it's now integrated in the app. Please double check materials/data you've recently discovered, the counter might be slightly off!\r\n* Fixed the \"Very Rare\" icon which was showing as \"Rare\"\r\n\r\n* FULL german translation available ! Many thanks to @Scorprox for his hard work and dedication\r\n* Spanish translations fixes, thanks a bunch to @TCAS !\r\n\r\n\r\n#1.0.1.3\r\n* Minor hotfix regarding previous patch (1.0.1.2)\r\n\r\n\r\n#1.0.1.2\r\n* Fixed a bug where the blueprints grid couldn't be sortable anymore by Type or Name\r\n* FULL spanish translation is finished! Many thanks to CMDR Aken (@omicrono) and CMDR TCAS (@TCAS) :)\r\n* Partial German translation (~40% complete) thanks to @rogerkilo and @Scorprox\r\n\r\n\r\n"
  },
  {
    "Version": "1.0.1.0",
    "Content": "#1.0.1.0\r\n* Localization ! Pick your language the first time. You can switch in te tasktray icon afterwards. Translation contributions are welcome!\r\n* Fixed an issue for commanders with a dot (.) in their name\r\n* Fixed an issue for users who installed the application on a domain server where manual changes were never saved. If that is your situation, please uninstall, delete the entire folder located in \"C:\\Users\\%USERNAME%\\AppData\\Local\\EDEngineer\" and reinstall the application\r\n\r\n\r\n#1.0.0.31\r\n* Persistent window state (locked / unlocked) between restarts\r\n* Salvaged your old favorites/ignored blueprints that were lost in the previous update!\r\n* Added a new Reset command in the tasktray icon in case your screen goes black. Checkout the Help command too!\r\n\r\n\r\n#1.0.0.30\r\nAnother hotfix for weird logs not containing any CMDR's information\r\n\r\n\r\n#1.0.0.29\r\nHotfix to handle weird logs some users have encountered.\r\n\r\n\r\n#1.0.0.28\r\nFixed a small display issue with the \"Last Update\" timestamp that would't be correctly displayed\r\n\r\n\r\n#1.0.0.27\r\n* Now supports multi commander ! (your GUI has been reset to avoid graphical issues since I've reworked the interface a bit in order to integrate that, sorry !)\r\n* Optimized log extraction, solve some issues with data acquisition issues (you might want to quickly check your data tab and see everything is still synchronized ; if it's not, you should fix it manually once and for all now)\r\n\r\n\r\n#1.0.0.26\r\nFixed a small issue with the Missing Commodity filter that would show blueprints not requiring commodities\r\n\r\n\r\n#1.0.0.25\r\nHotfix to correct the GUI. Your Window position and size has been reset (sorry!) to correct an issue that would make the entire overlay black otherwise\r\n\r\n\r\n#1.0.0.24\r\nFixed an issue that could make the GUI go entirely black due to 1.0.0.23 changes (check the release notes !)\r\n\r\n\r\n#1.0.0.23\r\n* Minor UI rework\r\n* Added a command in the tasktray icon to unlock the window (in case you don't know where the overlay is anymore)\r\n* In unlocked mode, you can now distribute the size of the overlay between the two columns. Don't forget the RESET button in case you want to go back to the initial position!\r\n\r\n\r\n#1.0.0.22\r\nLast update required to make the application support older version of Windows\r\n\r\n\r\n#1.0.0.21\r\nAgain, fixed the issue for old version of Windows\r\n\r\n\r\n#1.0.0.20\r\nFixed an issue that would occur on old version of Windows not supporting toasts when a favorite blueprint would become available to craft\r\n\r\n\r\n#1.0.0.19\r\n* Handle unknown commodities:\r\n  * powertransferconduits (Power Transfer Bus)\r\n  * powergridassembly (Energy Grid Assembly)\r\n* Improve overall performance\r\n* Correctly handle synthesis operations\r\n* Correctly handle mining refined operations\r\n* Added an error window for unhandled errors so that you can submit it with an issue if the application crashes\r\n\r\n\r\n#1.0.0.18\r\n* Now handle Scientific Community Goals (for instance the last one where you had to handover Pattern Obelisk Data)\r\n* Fixed a bug which made jettison decreases the number of cargo by one rather than the actual number of cargo jettisoned\r\n\r\n\r\n#1.0.0.17\r\nFixed an issue with engineer progress that would increase your cargo instead of reduce it by the amount of items necessary to unlock said engineer\r\n\r\n\r\n#1.0.0.16\r\n* The software now correctly works even if no logs are found in the log directory\r\n* Fixed an issue that would make the application lose synchronization with the logs when the window was locked/unlocked\r\n* Added new filter for cargo : display only ingredients needed for favorites blueprints\r\n\r\n\r\n#1.0.0.15\r\n* Fixed a bug that made the app incorrectly compute synthesis operations\r\n* Now correctly handle Engineer's unlock (when an engineer requires items to be unlocked, like Ram Tah and his 50 units of Classified Scan Databanks)\r\n\r\n\r\n#1.0.0.14\r\nQuick patch to remove unwanted debug code that slipped in 1.0.0.13\r\n\r\n\r\n#1.0.0.13\r\nFixed issue which would make the application crash when it would read invalid json outputted by the game\r\n\r\n\r\n#1.0.0.12\r\nFixed issue with release notes not showing up\r\n\r\n\r\n#1.0.0.11\r\n* Working release notes (don't panic if you see \"current version 1.0.0.0\", that's only the first time)\r\n* Favorited blueprints have their ingredients display a little star in your cargo list\r\n* New craftable filter for when only commodities are missing\r\n* Autoselect text when overriding cargo's count (protip: use TAB key to change currently editing entry)\r\n* New filter for ingredients (tick an ingredient to only see blueprints that require it)\r\n* Handle Material Discovery events (issue in Elite Dangerous itself, but I tried to handle it here as best as I could)\r\n\r\n\r\n#1.0.0.10\r\nFixed a bug in the monitoring of file with a temporary solution until I find what's wrong with .NET's FileSystemWatcher\r\n\r\n\r\n#1.0.0.9\r\n* Improve the refresh rate of the data\r\n* Fixed a bug where if you had the zero as hidden, the acquisition of a material would make the application crash\r\n\r\n\r\n#1.0.0.8\r\nFix an issue which could make some blueprints not visible in the list\r\n\r\n\r\n#1.0.0.7\r\nTake synthesis logs into account (they were not before, so if you do synthesis please check your materials)\r\n\r\n\r\n#1.0.0.6\r\nAdded new release notes popup when an update has been installed.\r\n\r\n\r\n#1.0.0.5\r\n* Fixed crash when parsing logs for entries that report material collection without size reported (probably old logs)\r\n* Unlocking the window now make it like a real \"normal\" window (minimize, maximize, appears in taskbar, etc...)\r\n\r\nUnknown materials added:\r\n* uncutfocuscrystals\r\n* fedcorecomposites\r\n* unknownenergysource\r\n\r\n\r\n#1.0.0.4\r\n* Move/Resize window\r\n* Editable counters\r\n\r\n\r\n#1.0.0.3\r\nAdded missing data:\r\n* Pattern Alpha Obelisk Data\r\n* Pattern Beta Obelisk Data\r\n* Pattern Epsilon Obelisk Data\r\n* Pattern Gamma Obelisk Data\r\n* Pattern Delta Obelisk Data\r\n\r\nAdded missing material:\r\n* Proprietary Composites\r\n\r\n\r\n#1.0.0.2\r\n2.2 blueprints added\r\n\r\n\r\n"
  }
]

