[
  {
    "Version": "1.0.3.0",
    "Content": "* Included a local API server (disabled by default) if you want to develop your own third-parties application or if you just want to export your commander's data! Supports Json (default), Xml and Csv. You can launch it via the tasktray icon, I strongly recommend taking a look at the documentation available in the GitHub project's wiki ! https://github.com/msarilar/EDEngineer/wiki \r\n* Added ingredients for blueprint Fragment Canon Double Shot G5\r\n\r\n * FULL russian localization now available! Many thanks to @Morozova, @Buchodt and @VChet for the great work. \r\n* Updated localization. Many thanks to @TCAS and @Scorprox for the great reactivity!"
  },
  {
    "Version": "1.0.2.4",
    "Content": "* Minor GUI animations to make it a bit more smooth (for example, when you select a blueprint in the right grid)\r\n\r\n* 100% finished french translation! Many thanks to Cmdr Bucho Xin Bu (@Buchodt), @calvin00 and @Giblood for the contributions and dedication!"
  },
  {
    "Version": "1.0.2.3",
    "Content": "* Added synthesis blueprints (thanks to @ravstar52 for providing the raw data!). They appear with a light blue color and you can distinguish the ingredients you have favorited from blueprints and from synthesis. In the Engineer filter, you have a new filter \"@Synthesis\" and new type filters are available too.\r\n\r\n* Updated localization"
  },
  {
    "Version": "1.0.2.2",
    "Content": "* Ingredients not used in a single blueprint now appear faded with a hint in the tooltip. Check it out!\r\n\r\n* Fixed an issue with commanders having special characters in their name (<, >, :, \", /, \\, |, ?, *)\r\n* Fixed an issue with users having multiple commanders which made the application not correctly update cargo (visually) after switching from active commander\r\n\r\n* French translation progress (not finished though) ; thanks to @calvin00 and @Giblood for the dedication! Almost there :)"
  },
  {
    "Version": "1.0.2.1",
    "Content": "* Hotfix to avoid debug popups in the released version"
  },
  {
    "Version": "1.0.2",
    "Content": "* Added material/data count. A warning will popup if you have 5 or less slots available, you can disable that warning in the tasktray icon context menu!\r\n* Added origin details to blueprints ingredients. Icons allow a quick view of the basic origin (market, mission, scan, surface, salvage, mining) and a tool tip will give more detail when you hover the ingredient (like \"Ship salvage (military & authority ships)\"). You can hide icons if it's too much visual noise via the new switch on top of the left panel.\r\n* Added an option to disable \"Blueprint Ready\" notifications in the context menu of the task tray icon (it's enabled by default)\r\n\r\n* Fixed an error in RamTah's blueprint which was missing CMM composite in its ingredient list. Please report any similar issue like this one if you see it!\r\n* Frontier's fixed an issue with \"Material Discovered\" event, it's now integrated in the app. Please double check materials/data you've recently discovered, the counter might be slightly off!\r\n* Fixed the \"Very Rare\" icon which was showing as \"Rare\"\r\n\r\n* FULL german translation available ! Many thanks to @Scorprox for his hard work and dedication\r\n* Spanish translations fixes, thanks a bunch to @TCAS !"
  },
  {
    "Version": "1.0.1.3",
    "Content": "* Minor hotfix regarding previous patch (1.0.1.2)"
  },
  {
    "Version": "1.0.1.2",
    "Content": "* Fixed a bug where the blueprints grid couldn't be sortable anymore by Type or Name\r\n* FULL spanish translation is finished! Many thanks to CMDR Aken (@omicrono) and CMDR TCAS (@TCAS) :)\r\n* Partial German translation (~40% complete) thanks to @rogerkilo and @Scorprox"
  },
  {
    "Version": "1.0.1.1",
    "Content": "* Fixed an issue linked to localization some Commanders experienced when using multiple accounts\r\n* The select language window is now showed on top of the overlay, not behind\r\n* Sharper rarity icons\r\n* Added Two buttons on the top right of the application (check all filters/uncheck all filters)"
  },
  {
    "Version": "1.0.1",
    "Content": "* Localization ! Pick your language the first time. You can switch in te tasktray icon afterwards. Translation contributions are welcome!\r\n* Fixed an issue for commanders with a dot (.) in their name\r\n* Fixed an issue for users who installed the application on a domain server where manual changes were never saved. If that is your situation, please uninstall, delete the entire folder located in \"C:\\Users\\%USERNAME%\\AppData\\Local\\EDEngineer\" and reinstall the application"
  },
  {
    "Version": "1.0.0.31",
    "Content": "* Persistent window state (locked / unlocked) between restarts\r\n* Salvaged your old favorites/ignored blueprints that were lost in the previous update!\r\n* Added a new Reset command in the tasktray icon in case your screen goes black. Checkout the Help command too!"
  },
  {
    "Version": "1.0.0.30",
    "Content": "Another hotfix for weird logs not containing any CMDR's information"
  },
  {
    "Version": "1.0.0.29",
    "Content": "Hotfix to handle weird logs some users have encountered."
  },
  {
    "Version": "1.0.0.28",
    "Content": "Fixed a small display issue with the \"Last Update\" timestamp that would't be correctly displayed"
  },
  {
    "Version": "1.0.0.27",
    "Content": "* Now supports multi commander ! (your GUI has been reset to avoid graphical issues since I've reworked the interface a bit in order to integrate that, sorry !)\r\n* Optimized log extraction, solve some issues with data acquisition issues (you might want to quickly check your data tab and see everything is still synchronized ; if it's not, you should fix it manually once and for all now)"
  },
  {
    "Version": "1.0.0.26",
    "Content": "Fixed a small issue with the Missing Commodity filter that would show blueprints not requiring commodities"
  },
  {
    "Version": "1.0.0.25",
    "Content": "Hotfix to correct the GUI. Your Window position and size has been reset (sorry!) to correct an issue that would make the entire overlay black otherwise"
  },
  {
    "Version": "1.0.0.24",
    "Content": "Fixed an issue that could make the GUI go entirely black due to 1.0.0.23 changes (check the release notes !)"
  },
  {
    "Version": "1.0.0.23",
    "Content": "* Minor UI rework\r\n* Added a command in the tasktray icon to unlock the window (in case you don't know where the overlay is anymore)\r\n* In unlocked mode, you can now distribute the size of the overlay between the two columns. Don't forget the RESET button in case you want to go back to the initial position!"
  },
  {
    "Version": "1.0.0.22",
    "Content": "Last update required to make the application support older version of Windows"
  },
  {
    "Version": "1.0.0.21",
    "Content": "Again, fixed the issue for old version of Windows"
  },
  {
    "Version": "1.0.0.20",
    "Content": "Fixed an issue that would occur on old version of Windows not supporting toasts when a favorite blueprint would become available to craft"
  },
  {
    "Version": "1.0.0.19",
    "Content": "* Handle unknown commodities:\r\n  * powertransferconduits (Power Transfer Bus)\r\n  * powergridassembly (Energy Grid Assembly)\r\n* Improve overall performance\r\n* Correctly handle synthesis operations\r\n* Correctly handle mining refined operations\r\n* Added an error window for unhandled errors so that you can submit it with an issue if the application crashes"
  },
  {
    "Version": "1.0.0.18",
    "Content": "* Now handle Scientific Community Goals (for instance the last one where you had to handover Pattern Obelisk Data)\r\n* Fixed a bug which made jettison decreases the number of cargo by one rather than the actual number of cargo jettisoned"
  },
  {
    "Version": "1.0.0.17",
    "Content": "Fixed an issue with engineer progress that would increase your cargo instead of reduce it by the amount of items necessary to unlock said engineer"
  },
  {
    "Version": "1.0.0.16",
    "Content": "* The software now correctly works even if no logs are found in the log directory\r\n* Fixed an issue that would make the application lose synchronization with the logs when the window was locked/unlocked\r\n* Added new filter for cargo : display only ingredients needed for favorites blueprints"
  },
  {
    "Version": "1.0.0.15",
    "Content": "* Fixed a bug that made the app incorrectly compute synthesis operations\r\n* Now correctly handle Engineer's unlock (when an engineer requires items to be unlocked, like Ram Tah and his 50 units of Classified Scan Databanks)"
  },
  {
    "Version": "1.0.0.14",
    "Content": "Quick patch to remove unwanted debug code that slipped in 1.0.0.13"
  },
  {
    "Version": "1.0.0.13",
    "Content": "Fixed issue which would make the application crash when it would read invalid json outputted by the game"
  },
  {
    "Version": "1.0.0.12",
    "Content": "Fixed issue with release notes not showing up"
  },
  {
    "Version": "1.0.0.11",
    "Content": "* Working release notes (don't panic if you see \"current version 1.0.0.0\", that's only the first time)\r\n* Favorited blueprints have their ingredients display a little star in your cargo list\r\n* New craftable filter for when only commodities are missing\r\n* Autoselect text when overriding cargo's count (protip: use TAB key to change currently editing entry)\r\n* New filter for ingredients (tick an ingredient to only see blueprints that require it)\r\n* Handle Material Discovery events (issue in Elite Dangerous itself, but I tried to handle it here as best as I could)"
  },
  {
    "Version": "1.0.0.10",
    "Content": "Fixed a bug in the monitoring of file with a temporary solution until I find what's wrong with .NET's FileSystemWatcher"
  },
  {
    "Version": "1.0.0.9",
    "Content": "* Improve the refresh rate of the data\r\n* Fixed a bug where if you had the zero as hidden, the acquisition of a material would make the application crash"
  },
  {
    "Version": "1.0.0.8",
    "Content": "Fix an issue which could make some blueprints not visible in the list"
  },
  {
    "Version": "1.0.0.7",
    "Content": "Take synthesis logs into account (they were not before, so if you do synthesis please check your materials)"
  },
  {
    "Version": "1.0.0.6",
    "Content": "Added new release notes popup when an update has been installed."
  },
  {
    "Version": "1.0.0.5",
    "Content": "* Fixed crash when parsing logs for entries that report material collection without size reported (probably old logs)\r\n* Unlocking the window now make it like a real \"normal\" window (minimize, maximize, appears in taskbar, etc...)\r\n\r\nUnknown materials added:\r\n* uncutfocuscrystals\r\n* fedcorecomposites\r\n* unknownenergysource"
  },
  {
    "Version": "1.0.0.4",
    "Content": "* Move/Resize window\r\n* Editable counters"
  },
  {
    "Version": "1.0.0.3",
    "Content": "Added missing data:\r\n* Pattern Alpha Obelisk Data\r\n* Pattern Beta Obelisk Data\r\n* Pattern Epsilon Obelisk Data\r\n* Pattern Gamma Obelisk Data\r\n* Pattern Delta Obelisk Data\r\n\r\nAdded missing material:\r\n* Proprietary Composites"
  },
  {
    "Version": "1.0.0.2",
    "Content": "2.2 blueprints added"
  }
]

